const sorting = require("../../app");

describe("Books names test suit", () => {
  it("Books names should be sorted in ascending order", () => {
    expect(
      sorting.sortByName([
        "Гарри Поттер",
        "Властелин Колец",
        "Волшебник изумрудного города",
      ])
    ).toEqual([
      "Властелин Колец",
      "Волшебник изумрудного города",
      "Гарри Поттер",
    ]);
  });
  it("Books names test suit", () => {
    expect(
      sorting.sortByName([
        "112 служба спасения. Поучительные истории.",
        "112 служба спасения. Поучительные истории.",
        "Акка и её друзья",
        "Буква Бука",
      ])
    ).toEqual([
        "112 служба спасения. Поучительные истории.",
        "112 служба спасения. Поучительные истории.",
        "Акка и её друзья",
        "Буква Бука",
    ]);
});
});
